# 计算路口车流流向图的数据

# 路口：五分钟一次统计经过这个路口的四个方向的车辆的count
""" {
insect:"路口1",
times:{
    time:"7:00-7:05",
    counts:{
        西直:221
        西左:12
        西右:12
        西掉:2
        东直:31
        东左:0
        东右:2
        东掉:14
        南直:
        南左:5
        南右:
        南掉:
        北直:
        北左:
        北右:
        北掉:
    }
}
} """
import json
import os
from collections import defaultdict
from datetime import datetime,timedelta
# 路口四个方向fid：road_sec_id为0

road_to = {
    "路口1": {
        "左道路": {
            "直行": [2354, 70438, 80707, 80710, 80715],
            "左转": [
                70446,
                80705,
                80706,
                80711,
                80712,
            ],
            "右转": [
                70441,
                80709,
                80713,
            ],
            "掉头": [82032, 82033],
        },
        "右道路": {
            "直行": [
                66,
                2360,
                70437,
                80720,
                80721,
            ],
            "左转": [70445, 80719, 80733],
            "右转": [
                70439,
                80722,
                80723,
            ],
            "掉头": [82035, 82036],
        },
        "上道路": {
            "直行": [70435, 80550, 80551],
            "左转": [
                70444,
                80728,
                80729,
                80730,
            ],
            "右转": [
                70440,
                80726,
                80727,
            ],
            "掉头": [82031],
        },
        "下道路": {
            "直行": [70436, 80546, 80547],
            "左转": [2340, 70443, 80702, 80703, 80704],
            "右转": [70442, 80716, 80717, 80718],
            "掉头": [],
        },
    },
    "路口2": {
        "左道路": {
            "直行": [2328, 2329, 2330, 2331, 2333, 2540, 70450],
            "左转": [2281, 2312, 2313, 70456],
            "右转": [2322, 2323, 70453],
            "掉头": [2853],
        },
        "右道路": {
            "直行": [2326, 2327, 2539, 2545, 70449],
            "左转": [2282, 70455],
            "右转": [2318, 2319, 70451],
            "掉头": [2850, 2851, 2852],
        },
        "上道路": {
            "直行": [2336, 2337, 2338, 70448],
            "左转": [2308, 2309, 2310, 2311, 70458],
            "右转": [2320, 2321, 70452],
            "掉头": [2095, 2132],
        },
        "下道路": {
            "直行": [2334, 2335, 2339, 70447],
            "左转": [2314, 2315, 70457],
            "右转": [2316, 2317, 2324, 2325, 2332, 70454],
            "掉头": [2854, 2855],
        },
    },
    "路口3": {
        "左道路": {
            "直行": [2089,2090,2091,2542,70468,],
            "左转": [2075,2076,70464],
            "右转": [2098,2356,70459,],
            "掉头": [],
        },
        "右道路": {
            "直行": [2092,2093,2094,2541,70467,],
            "左转": [2083,2084,70463,],
            "右转": [2096,2358,70461,],
            "掉头": [],
        },
        "上道路": {
            "直行": [2087,2088,70470],
            "左转": [2077,2078,2079,70466],
            "右转": [2097,2357,70462],
            "掉头": [],
        },
        "下道路": {
            "直行": [2085,2086,70469,],
            "左转": [2080,2081,2082,70465],
            "右转": [2099,2355,70460,],
            "掉头": [],
        },
    },
    "路口4": {
        "左道路": {
            "直行": [2134,2135,2136,2137,70482],
            "左转": [2109,2110,2111,2120,70476],
            "右转": [2112,2116,70474,],
            "掉头": [],
        },
        "右道路": {
            "直行": [2129,2130.2131,2133,70481],
            "左转": [2106,2107,2108,70475],
            "右转": [2114,2118,70472,],
            "掉头": [],
        },
        "上道路": {
            "直行": [2125,2126,2127,2128,70480],
            "左转": [2103,2104,2105,70477],
            "右转": [2115,2119,70473,],
            "掉头": [],
        },
        "下道路": {
            "直行": [2121,2122,2123,2124,70479],
            "左转": [2100,2101,2102,70478],
            "右转": [2113,2117,70471],
            "掉头": [],
        },
    },
    "路口5": {
        "左道路": {
            "直行": [70550,80700,80701],
            "左转": [70547,80698,80699],
            "右转": [],
            "掉头": [],
        },
        "右道路": {
            "直行": [2366,70549,80695,82002],
            "左转": [],
            "右转": [70545,80542,81518],
            "掉头": [],
        },
        "上道路": {
            "直行": [],
            "左转": [70548,80539,80540,],
            "右转": [70546,80696,80697],
            "掉头": [],
        },
        "下道路": {
            "直行": [],
            "左转": [],
            "右转": [],
            "掉头": [],
        },
    },
    "路口6": {
        "左道路": {
            "直行": [70556,81006,81007,],
            "左转": [70553,81004,81005,],
            "右转": [],
            "掉头": [],
        },
        "右道路": {
            "直行": [70555,81002,81003,81016,81500],
            "左转": [],
            "右转": [70551,81000,81001],
            "掉头": [],
        },
        "上道路": {
            "直行": [],
            "左转": [70554,81012,81013,81014,81015],
            "右转": [70552,81008,81009,81010,81011],
            "掉头": [],
        },
        "下道路": {
            "直行": [],
            "左转": [],
            "右转": [],
            "掉头": [],
        },
    },
    "路口7": {
        "左道路": {
            "直行": [2990,2991,70561,],
            "左转": [2994,70559,],
            "右转": [4814,],
            "掉头": [],
        },
        "右道路": {
            "直行": [2988,2989,70562],
            "左转": [2998,],
            "右转": [2997,70558,],
            "掉头": [],
        },
        "上道路": {
            "直行": [],
            "左转": [2995,2996,70560],
            "右转": [2992,2993,70557,],
            "掉头": [],
        },
        "下道路": {
            "直行": [2811],
            "左转": [4813,],
            "右转": [2999],
            "掉头": [],
        },
    },
    "路口8": {
        "左道路": {
            "直行": [70566,80983,80984],
            "左转": [70565,80981,80982,],
            "右转": [2984,],
            "掉头": [],
        },
        "右道路": {
            "直行": [70567,80977,80980,],
            "左转": [],
            "右转": [70564,80978,80979,],
            "掉头": [],
        },
        "上道路": {
            "直行": [2982,],
            "左转": [70568,80987,80988],
            "右转": [70563,80985,80986],
            "掉头": [],
        },
        "下道路": {
            "直行": [2979,2980,2981],
            "左转": [2985,],
            "右转": [2983,],
            "掉头": [],
        },
    },
}

# 计算每5分钟不同路口的流向通行量
# 车辆数据路径
input_directory = (
    "D:/VIScode/chinavis-2023/backend/data/situation/time/type_nostop/"
)
# 输出文件保存路径
output_directory = "D:/VIScode/chinavis-2023/backend/dataProcess/data/interSection/flow.json"

# 定义保存结果的字典
result_5min = defaultdict(lambda:defaultdict(lambda:defaultdict(lambda:defaultdict(set))))
# 遍历每个半小时文件夹
for hour in range(0, 18):
    hour_folder = input_directory + f"{int(hour/2+7)}_{0 if hour%2==0 else 3}0hour"
    # 遍历机动车类型文件
    for type_file in ["type_1.json","type_4.json","type_6.json"]:
        file_path = os.path.join(hour_folder, type_file)
        # print(file_path)
        # 读取车辆数据文件
        with open(file_path, "r") as f:
            data = [json.loads(line) for line in f]
        # # 统计每个车辆的数据
        # count = defaultdict(set)
        for item in data:
            id = item["id"]
            fid=item["fid"]
            timestamp = item["time_meas"]
            dt = datetime.fromtimestamp(timestamp / 1000000)
            tm=dt-timedelta(minutes=dt.minute%5)
            time = tm.strftime("%H:%M")
            # print(time)
            for insect_name, directions in road_to.items():
                for dir_name, turns in directions.items():
                    for turn_name, fids in turns.items():
                        if fid in fids:
                            # 如果这条数据在这个道路上
                            result_5min[time][insect_name][dir_name][turn_name].add(id)
                            # print(len(result_5min[time][insect_name][dir_name][turn_name]))
                            # with open(file_out,"a") as f:
                            #     json.dump(item,f)
                            #     f.write('\n')



result_counts = defaultdict(lambda:defaultdict(lambda:defaultdict(lambda:defaultdict(int))))
# 统计每个流向的车辆数量
for time, time_data in result_5min.items():
    for insect_name, insect_data in time_data.items():
        for dir_name, dir_data in insect_data.items():
            for turn_name, turn_data in dir_data.items():
                result_counts[time][insect_name][dir_name][turn_name] = len(turn_data)
# 保存结果
# for insect_name, directions in road_to.items():
#     for dir_name, turns in directions.items():
#         for turn_name, fids in turns.items():
#             if turn_name not in result_5min[time][insect_name][dir_name]:
#                 result_counts[time][insect_name][dir_name][turn_name]=0
                         
with open(output_directory, "w", encoding="utf-8") as f:
    json.dump(result_counts, f, ensure_ascii=False, indent=4)
